Tekla Open API Reference for Tekla Structures 2025
Picker.IsInteractive Method
 Indicates whether the picker is interactive and currently allowed to access the UI or not. If not, then the plug-in should avoid making dialog calls or message boxes.
 Namespace: Tekla.Structures.Drawing.UI
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool IsInteractive()
Public Function IsInteractive As Boolean
Return Value
Type: Boolean
True if the picker is interactive.
See Also
Reference
Picker Class
Tekla.Structures.Drawing.UI Namespace